non-uniform-mesh/single-block/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

x1 0;
x2 1;
y1 0;
y2 1;
z1 0;
z2 0.1;

xcells 20;
ycells 20;
zcells 1;


vertices
(
    //back  
    ($x1  $y1  $z1)	//0
    ($x2  $y1  $z1)	//1
    ($x2  $y2  $z1)	//2
    ($x1  $y2  $z1)	//3    
    ($x1  $y1  $z2)	//4
    ($x2  $y1  $z2)	//5
    ($x2  $y2  $z2)	//6
    ($x1  $y2  $z2)	//7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) ($xcells  $ycells  $zcells) simpleGrading (10 0.1 1)
);

edges
(
);

boundary
(
    movingWall
    {
        type wall;
        faces
        (
            (3 7 6 2)
        );
    }
    fixedWalls
    {
        type wall;
        faces
        (
            (0 4 7 3)
            (2 6 5 1)
            (1 5 4 0)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
